OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_ctr.c
// AES CTR - Custom test vector - long
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_128_decrypt_long) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 128 Decrypt message_len=250",
    .p_plaintext        = ctr_long_plain,
    .p_ciphertext       = ctr_128_long_cipher,
    .p_key              = ctr_128_key,
    .p_iv               = ctr_counter_1
};

// AES CTR - Custom test vector - short
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_128_decrypt_short) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 128 Decrypt message_len=0",
    .p_plaintext        = "",
    .p_ciphertext       = "",
    .p_key              = ctr_128_key,
    .p_iv               = ctr_counter_1
};

// AES CTR - NIST SP 800-38A CTR-AES128.Decrypt - Block 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_128_decrypt_1) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 128 Decrypt message_len=16 valid 1",
    .p_plaintext        = ctr_plain_1,
    .p_ciphertext       = ctr_128_cipher_1,
    .p_key              = ctr_128_key,
    .p_iv               = ctr_counter_1,
    .p_ad               = ctr_counter_2
};

// AES CTR - NIST SP 800-38A CTR-AES128.Decrypt - Block 2
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_128_decrypt_2) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 128 Decrypt message_len=16 valid 2",
    .p_plaintext        = ctr_plain_2,
    .p_ciphertext       = ctr_128_cipher_2,
    .p_key              = ctr_128_key,
    .p_iv               = ctr_counter_2,
    .p_ad               = ctr_counter_3
};

// AES CTR - NIST SP 800-38A CTR-AES128.Decrypt - Block 3
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_128_decrypt_3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 128 Decrypt message_len=16 valid 3",
    .p_plaintext        = ctr_plain_3,
    .p_ciphertext       = ctr_128_cipher_3,
    .p_key              = ctr_128_key,
    .p_iv               = ctr_counter_3,
    .p_ad               = ctr_counter_4
};

// AES CTR - NIST SP 800-38A CTR-AES128.Decrypt - Block 4
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_128_decrypt_4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 128 Decrypt message_len=16 valid 4",
    .p_plaintext        = ctr_plain_4,
    .p_ciphertext       = ctr_128_cipher_4,
    .p_key              = ctr_128_key,
    .p_iv               = ctr_counter_4,
    .p_ad               = ctr_counter_5
};

// AES CTR - NIST SP 800-38A CTR-AES128.Decrypt - Counter Oveflow
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_128_decrypt_5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 128 Decrypt Counter Overflow",
    .p_plaintext        = "563d9cd1fcf40d7335cfe7932ae6183c",
    .p_ciphertext       = "cfcb732b9d80dc141cb6a163516e0882",
    .p_key              = "7d5b752df6956655c091c69fb2684483",
    .p_iv               = "ffffffffffffffffffffffffffffffff",
    .p_ad               = "00000000000000000000000000000000"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CTR_128)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CTR_192)

const char ctr_192_key[]           = { "8e73b0f7da0e6452c810f32b809079e562f8ead2522c6b7b" };
const char ctr_192_long_cipher[]   = { "a92a37ba2dac97aea88286248063bbdbaa7be2bc93d3783239169e93dc24f9cc37b14b080300ff345e26ca874a1608a5afe63779ccff86e2072b499bbf41400e27e5cabe58fca4ffe09e784cc5cfca70930f46ad9227b517d872291b05d8456085d360f1a27ea78c5efd48aaa80d6b9a17f07eb814082fa6746b48e8b308e90345927f4c587d9c6b18c2e166efbfc538e0e02d0162a42ac696a013290757f80e8bc04135efe6c2f3166259e1878d091d7c00e30f18ab9c20b2ff62f7e0d8a7ab8120ef931e4a272f4f3760c0def8b3059834767b3476cd538bfc25709e936ced8825d02cf2283db2807f1fb903f2c0fef64d6f478e67d68af46a" };
const char ctr_192_cipher_1[]      = { "1abc932417521ca24f2b0459fe7e6e0b" };
const char ctr_192_cipher_2[]      = { "090339ec0aa6faefd5ccc2c6f4ce8e94" };
const char ctr_192_cipher_3[]      = { "1e36b26bd1ebc670d1bd1d665620abf7" };
const char ctr_192_cipher_4[]      = { "4f78a7f6d29809585a97daec58c6b050" };

// AES CTR - Functional test using test vector NIST SP 800-38A CTR-AES192.Encrypt - Block 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_func_data, test_vector_aes_t test_vector_aes_ctr_192_functional) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .p_test_vector_name = "CTR 192 Functional",
    .p_plaintext        = ctr_plain_1,
    .p_ciphertext       = ctr_192_cipher_1,
    .p_key              = ctr_192_key,
    .p_iv               = ctr_counter_1
};

// AES CTR - Custom test vector - long
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_192_encrypt_long) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 192 Encrypt message_len=250",
    .p_plaintext        = ctr_long_plain,
    .p_ciphertext       = ctr_192_long_cipher,
    .p_key              = ctr_192_key,
    .p_iv               = ctr_counter_1
};

// AES CTR - Custom test vector - short
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_192_encrypt_short) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 192 Encrypt message_len=0",
    .p_plaintext        = "",
    .p_ciphertext       = "",
    .p_key              = ctr_192_key,
    .p_iv               = ctr_counter_1
};

// AES CTR - NIST SP 800-38A CTR-AES192.Encrypt - Block 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_192_encrypt_1) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 192 Encrypt message_len=16 valid 1",
    .p_plaintext        = ctr_plain_1,
    .p_ciphertext       = ctr_192_cipher_1,
    .p_key              = ctr_192_key,
    .p_iv               = ctr_counter_1,
    .p_ad               = ctr_counter_2
};

// AES CTR - NIST SP 800-38A CTR-AES192.Encrypt - Block 2
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_192_encrypt_2) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 192 Encrypt message_len=16 valid 2",
    .p_plaintext        = ctr_plain_2,
    .p_ciphertext       = ctr_192_cipher_2,
    .p_key              = ctr_192_key,
    .p_iv               = ctr_counter_2,
    .p_ad               = ctr_counter_3
};

// AES CTR - NIST SP 800-38A CTR-AES192.Encrypt - Block 3
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_192_encrypt_3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 192 Encrypt message_len=16 valid 3",
    .p_plaintext        = ctr_plain_3,
    .p_ciphertext       = ctr_192_cipher_3,
    .p_key              = ctr_192_key,
    .p_iv               = ctr_counter_3,
    .p_ad               = ctr_counter_4
};

// AES CTR - NIST SP 800-38A CTR-AES192.Encrypt - Block 4
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_192_encrypt_4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 192 Encrypt message_len=16 valid 4",
    .p_plaintext        = ctr_plain_4,
    .p_ciphertext       = ctr_192_cipher_4,
    .p_key              = ctr_192_key,
    .p_iv               = ctr_counter_4,
    .p_ad               = ctr_counter_5
};

