OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0_59ac345/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_ctr.c
// AES CTR - Custom test vector - long
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_encrypt_long) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 256 Encrypt message_len=250",
    .p_plaintext        = ctr_long_plain,
    .p_ciphertext       = ctr_256_long_cipher,
    .p_key              = ctr_256_key,
    .p_iv               = ctr_counter_1
};

// AES CTR - Custom test vector - short
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_encrypt_short) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 256 Encrypt message_len=0",
    .p_plaintext        = "",
    .p_ciphertext       = "",
    .p_key              = ctr_256_key,
    .p_iv               = ctr_counter_1
};


// AES CTR - NIST SP 800-38A CTR-AES256.Encrypt - Block 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_encrypt_1) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 256 Encrypt message_len=16 valid 1",
    .p_plaintext        = ctr_plain_1,
    .p_ciphertext       = ctr_256_cipher_1,
    .p_key              = ctr_256_key,
    .p_iv               = ctr_counter_1,
    .p_ad               = ctr_counter_2
};

// AES CTR - NIST SP 800-38A CTR-AES256.Encrypt - Block 2
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_encrypt_2) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 256 Encrypt message_len=16 valid 2",
    .p_plaintext        = ctr_plain_2,
    .p_ciphertext       = ctr_256_cipher_2,
    .p_key              = ctr_256_key,
    .p_iv               = ctr_counter_2,
    .p_ad               = ctr_counter_3
};

// AES CTR - NIST SP 800-38A CTR-AES256.Encrypt - Block 3
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_encrypt_3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 256 Encrypt message_len=16 valid 3",
    .p_plaintext        = ctr_plain_3,
    .p_ciphertext       = ctr_256_cipher_3,
    .p_key              = ctr_256_key,
    .p_iv               = ctr_counter_3,
    .p_ad               = ctr_counter_4
};

// AES CTR - NIST SP 800-38A CTR-AES256.Encrypt - Block 4
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_encrypt_4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 256 Encrypt message_len=16 valid 4",
    .p_plaintext        = ctr_plain_4,
    .p_ciphertext       = ctr_256_cipher_4,
    .p_key              = ctr_256_key,
    .p_iv               = ctr_counter_4,
    .p_ad               = ctr_counter_5
};

// AES CTR - NIST SP 800-38A CTR-AES256.Encrypt - Counter Oveflow
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_encrypt_5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CTR 256 Encrypt Counter Overflow",
    .p_plaintext        = "2bdb7c499b55bfe636860c320d2eee1b",
    .p_ciphertext       = "02a1ef073c9c0ba74f195564455398c5",
    .p_key              = "47778b2c9558790eb5def620fafcb8f5a447e3bfe34eb8d6c0911b27f0f95e85",
    .p_iv               = "ffffffffffffffffffffffffffffffff",
    .p_ad               = "00000000000000000000000000000000"
};

// AES CTR - Custom test vector - long
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_decrypt_long) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 256 Decrypt message_len=250",
    .p_plaintext        = ctr_long_plain,
    .p_ciphertext       = ctr_256_long_cipher,
    .p_key              = ctr_256_key,
    .p_iv               = ctr_counter_1
};

// AES CTR - Custom test vector - short
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_decrypt_short) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 256 Decrypt message_len=0",
    .p_plaintext        = "",
    .p_ciphertext       = "",
    .p_key              = ctr_256_key,
    .p_iv               = ctr_counter_1
};


// AES CTR - NIST SP 800-38A CTR-AES256.Decrypt - Block 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_decrypt_1) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 256 Decrypt message_len=16 valid 1",
    .p_plaintext        = ctr_plain_1,
    .p_ciphertext       = ctr_256_cipher_1,
    .p_key              = ctr_256_key,
    .p_iv               = ctr_counter_1,
    .p_ad               = ctr_counter_2
};

// AES CTR - NIST SP 800-38A CTR-AES256.Decrypt - Block 2
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_decrypt_2) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 256 Decrypt message_len=16 valid 2",
    .p_plaintext        = ctr_plain_2,
    .p_ciphertext       = ctr_256_cipher_2,
    .p_key              = ctr_256_key,
    .p_iv               = ctr_counter_2,
    .p_ad               = ctr_counter_3
};

// AES CTR - NIST SP 800-38A CTR-AES256.Decrypt - Block 3
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_decrypt_3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 256 Decrypt message_len=16 valid 3",
    .p_plaintext        = ctr_plain_3,
    .p_ciphertext       = ctr_256_cipher_3,
    .p_key              = ctr_256_key,
    .p_iv               = ctr_counter_3,
    .p_ad               = ctr_counter_4
};

// AES CTR - NIST SP 800-38A CTR-AES256.Decrypt - Block 4
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_decrypt_4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 256 Decrypt message_len=16 valid 4",
    .p_plaintext        = ctr_plain_4,
    .p_ciphertext       = ctr_256_cipher_4,
    .p_key              = ctr_256_key,
    .p_iv               = ctr_counter_4,
    .p_ad               = ctr_counter_5
};

// AES CTR - NIST SP 800-38A CTR-AES256.Decrypt - Counter Oveflow
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_ctr_256_decrypt_5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_ctr_256_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CTR 256 Decrypt Counter Overflow",
    .p_plaintext        = "2bdb7c499b55bfe636860c320d2eee1b",
    .p_ciphertext       = "02a1ef073c9c0ba74f195564455398c5",
    .p_key              = "47778b2c9558790eb5def620fafcb8f5a447e3bfe34eb8d6c0911b27f0f95e85",
    .p_iv               = "ffffffffffffffffffffffffffffffff",
    .p_ad               = "00000000000000000000000000000000"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CTR_256)

/*lint -restore */

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CTR)
